БукмекерскаяКонтора/src/Documents/ЗапросНаСнятие/ЗапросНаСнятие.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗапросНаСнятие</name>
  <registerRecords>AccumulationRegister.ЗапросНаСнятие</registerRecords>
  <attributes>
    <name>Игрок</name>
    <type>
      <types>CatalogRef.Игроки</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаСнятия</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>9</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СпособСнятия</name>
    <type>
      <types>EnumRef.СпособСнятия</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерКарты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>16</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерТелефона</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>11</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СнятиеСДепозита</name>
    <type>
      <types>DocumentRef.СнятиеСДепозита</types>
    </type>
  </attributes>
</mdclass:Document>

БукмекерскаяКонтора/src/AccumulationRegisters/Депозиты/Депозиты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Депозиты</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаРезерва</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Игрок</name>
    <type>
      <types>CatalogRef.Игроки</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

БукмекерскаяКонтора/src/AccumulationRegisters/ЗапросНаСнятие/ЗапросНаСнятие.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ЗапросНаСнятие</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>9</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Игрок</name>
    <type>
      <types>CatalogRef.Игроки</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

БукмекерскаяКонтора/src/Enums/СтатусПлатежа/СтатусПлатежа.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусПлатежа</name>
  <enumValues>
    <name>НаРассмотрении</name>
  </enumValues>
  <enumValues>
    <name>Принят</name>
  </enumValues>
  <enumValues>
    <name>Отменен</name>
  </enumValues>
</mdclass:Enum>

БукмекерскаяКонтора/src/Documents/СнятиеСДепозита/СнятиеСДепозита.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>СнятиеСДепозита</name>
  <registerRecords>AccumulationRegister.Депозиты</registerRecords>
  <registerRecords>AccumulationRegister.ЗапросНаСнятие</registerRecords>
  <attributes>
    <name>ЗапросНаСнятие</name>
    <type>
      <types>DocumentRef.ЗапросНаСнятие</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусПлатежа</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
</mdclass:Document>

БукмекерскаяКонтора/src/Documents/ЗапросНаСнятие/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	ПараметрыОтбора = Новый Структура();
	ПараметрыОтбора.Вставить("Игрок", Игрок);
	
	Депозиты = РегистрыНакопления.Депозиты.Выбрать(,,ПараметрыОтбора,);
	ЗапросыНаСнятие = РегистрыНакопления.ЗапросНаСнятие.Выбрать(,,ПараметрыОтбора,);
	ДоступнаяСумма = 0;
	
	Пока Депозиты.Следующий() Цикл
		Если Депозиты.ВидДвижения = ВидДвиженияНакопления.Приход
		Тогда
			ДоступнаяСумма = ДоступнаяСумма + Депозиты.Сумма - Депозиты.СуммаРезерва;
		Иначе
			ДоступнаяСумма = ДоступнаяСумма - Депозиты.Сумма + Депозиты.СуммаРезерва;
		КонецЕсли;
	КонецЦикла;
	
	
	Пока ЗапросыНаСнятие.Следующий() Цикл
		Если ЗапросыНаСнятие.ВидДвижения = ВидДвиженияНакопления.Приход
		Тогда
			ДоступнаяСумма = ДоступнаяСумма - ЗапросыНаСнятие.Сумма;
		Иначе
			ДоступнаяСумма = ДоступнаяСумма + ЗапросыНаСнятие.Сумма;
		КонецЕсли;
	КонецЦикла;
		
	Если СуммаСнятия > ДоступнаяСумма Тогда
		Отказ = Истина;
		Сообщить("Недостаточно средств");
	Иначе
		Движения.ЗапросНаСнятие.Записывать = Истина;
		Движение = Движения.ЗапросНаСнятие.ДобавитьПриход();
		Движение.Игрок = Игрок;
		Движение.Сумма = СуммаСнятия;
		Движение.Период = Дата;
		
		Документ = Документы.СнятиеСДепозита.СоздатьДокумент();
		Документ.ЗапросНаСнятие = Ссылка;
		Документ.Статус = ПредопределенноеЗначение("Перечисление.СтатусПлатежа.НаРассмотрении");
		Документ.Дата = Дата;
		Документ.Записать();
		
		ЭтотОбъект.СнятиеСДепозита = Документ.Ссылка;
		ЭтотОбъект.Записать();
	КонецЕсли;
КонецПроцедуры
